Revit 2027 API
BaseExportOptions.GetExportPatternTable Method
 Gets a copy of the pattern table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPatternTable GetExportPatternTable()
Public Function GetExportPatternTable As ExportPatternTable
public:
ExportPatternTable^ GetExportPatternTable()
member GetExportPatternTable : unit -> ExportPatternTable
Return Value
ExportPatternTable
 The pattern table.
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace